#+title:      A Klasse 2022-26
#+date:       [2022-12-28 Mi 20:48]
#+filetags:   :1a:Project:
#+identifier: 20221228T204848
#+CATEGORY: golling


* 1a 08:40-09:30
<%%(org-class 2022 9 13 2023 7 4 2)>

Film über Burschen in Palästina / ...

* 1a 12:30-13:20
<%%(org-class 2022 9 16 2023 7 7 5 23)>

Spielestunde

* Reflexionen


* 1A [KV Manuela Singer]

#+Name: 2021-students
| First     | Last       | Name               | Note | Mitarbeit | Heft | LZK |
|-----------+------------+--------------------+------+-----------+------+-----|
| Tobias    | Bernhofer  | [[Tobias Bernhofer][Tobias Bernhofer]]   |    1 |           |      |     |
| Alexander | Cerny      | [[Alexander Cerny][Alexander Cerny]]    |    1 |           |      |     |
| Laurin    | Ellmer     | [[Laurin Ellmer][Laurin Ellmer]]      |    1 |           |      |     |
| Amrit     | Gappmaier  | [[Amrit Gappmaier][Amrit Gappmaier]]    |    1 |           |      |     |
| Olivia    | Gappmaier  | [[Olivia Gappmaier][Olivia Gappmaier]]   |    1 |           |      |     |
| Nadine    | Gschiel    | [[Nadine Gschiel][Nadine Gschiel]]     |    1 |           |      |     |
| Damien    | Hettegger  | [[Damien Hettegger][Damien Hettegger]]   |    1 |           |      |     |
| Christian | Kronreif   | [[Christian Kronreif][Christian Kronreif]] |    1 |           |      |     |
| Rafael    | Lainer     | [[Rafael Lainer][Rafael Lainer]]      |    1 |           |      |     |
| Leopold   | Lechner    | [[Leopold Lechner][Leopold Lechner]]    |    1 |           |      |     |
| Hannah    | Lutje      | [[Hannah Lutje][Hannah Lutje]]       |    1 |           |      |     |
| Leonhard  | Malter     | [[Leonhard Malter][Leonhard Malter]]    |    1 |           |      |     |
| Sunmaya   | Marek      | [[Sunmaya Marek][Sunmaya Marek]]      |    1 |           |      |     |
| Khushboo  | Markandey  | [[Khushboo Markandey][Khushboo Markandey]] |    1 |           |      |     |
| Moritz    | Neuhofer   | [[Moritz Neuhofer][Moritz Neuhofer]]    |    1 |           |      |     |
| Heidi     | Pichler    | [[Heidi Pichler][Heidi Pichler]]      |    1 |           |      |     |
| Jakob     | Salchegger | [[Jakob Salchegger][Jakob Salchegger]]   |    1 |           |      |     |
| Elias     | Schieferer | [[Elias Schieferer][Elias Schieferer]]   |    1 |           |      |     |
| Nikolaj   | Schwaiger  | [[Nikolaj Schwaiger][Nikolaj Schwaiger]]  |    1 |           |      |     |
| Florian   | Siller     | [[Florian Siller][Florian Siller]]     |    1 |           |      |     |
| Michael   | Steiner    | [[Michael Steiner][Michael Steiner]]    |    1 |           |      |     |
| Pascal    | Stippler   | [[Pascal Stippler][Pascal Stippler]]    |    1 |           |      |     |
| Esther    | Tong       | [[Esther Tong][Esther Tong]]        |    1 |           |      |     |
| Alexander | Wenger     | [[Alexander Wenger][Alexander Wenger]]   |    1 |           |      |     |
| Oskar     | Wieser     | [[Oskar Wieser][Oskar Wieser]]       |    1 |           |      |     |
| Veit      | Zierfuß    | [[Veit Zierfuß][Veit Zierfuß]]       |    1 |           |      |     |
#+TBLFM: $4=vmean($5..$>)
#+TBLFM: $3='(concat "[[" $1 " " $2 "][" $1 " " $2 "]]")
#+TBLFM: $4='(identity remote(2021-22-Mitarbeit,@@#$4))


#+BEGIN_SRC python :var table=2021-students :results output raw
print('* Mitarbeit')
for student in table:
    first = student[0]
    last = student[1]
    email = first + '.' + last + '@golling.schule'
    print('** ' + first + ' ' + last + '\n\n')  
#+END_SRC

#+RESULTS:
* Mitarbeit
** Tobias Bernhofer


** Alexander Cerny


** Laurin Ellmer


** Amrit Gappmaier


** Olivia Gappmaier


** Nadine Gschiel


** Damien Hettegger


** Christian Kronreif


** Rafael Lainer


** Leopold Lechner


** Hannah Lutje


** Leonhard Malter


** Sunmaya Marek


** Khushboo Markandey


** Moritz Neuhofer


** Heidi Pichler


** Jakob Salchegger


** Elias Schieferer


** Nikolaj Schwaiger


** Florian Siller


** Michael Steiner


** Pascal Stippler


** Esther Tong


** Alexander Wenger


** Oskar Wieser


** Veit Zierfuß
